{
  "GET /api": {
    "description": "serves up a json representation of all the available endpoints of the api"
  },
  "GET /api/topics": {
    "description": "serves an array of all topics",
    "exampleResponse": {
      "topics": [
        {
          "slug": "coding",
          "description": "Code is love, code is life"
        },
        {
          "slug": "football",
          "description": "FOOTIE!"
        },
        {
          "slug": "cooking",
          "description": "Hey good looking, what you got cooking?"
        }
      ]
    }
  },
  "GET /api/articles": {
    "description": "responds with an array of all articles with the newest dislpayed first if no queries present, also accepts queries to filter atricles by topic, and sort by author, date created, title, article ID, votes, comment count, asc or descending",
    "queries": ["topic", "sort_by", "order"],
    "exampleResponse": {
      "articles": [
        {
          "article_id": 34,
          "title": "The Notorious MSG’s Unlikely Formula For Success",
          "topic": "cooking",
          "author": "grumpy19",
          "body": "The 'umami' craze has turned a much-maligned and misunderstood food additive into an object of obsession for the world’s most innovative chefs. But secret ingredient monosodium glutamate’s biggest secret may be that there was never anything wrong with it at all.",
          "created_at": "2020-11-22T11:13:00.000Z",
          "votes": 0,
          "article_img_url": "https://images.pexels.com/photos/2403392/pexels-photo-2403392.jpeg?w=700&h=700",
          "comment_count": "11"
        },
        {
          "article_id": 12,
          "title": "The battle for Node.js security has only begun",
          "topic": "coding",
          "author": "tickle122",
          "body": "The founder of the Node Security Project says Node.js still has common vulnerabilities, but progress has been made to make it more secure. Appearing at the recent Node Community Convention in San Francisco, project founder Adam Baldwin, chief security officer at Web consulting company &yet, emphasized risks, protections, and progress. Baldwin sees four risks within the Node ecosystem pertinent to the enterprise: the code dependency tree, bugs, malicious actors, and people. I think of [the dependency tree] more as the dependency iceberg, to be honest, Baldwin said, where your code is the ship and your dependencies that you have with your packaged JSON is that little tiny iceberg at the top. But developers need to be aware of the massive iceberg underneath, he stressed.",
          "created_at": "2020-11-15T13:25:00.000Z",
          "votes": 0,
          "article_img_url": "https://images.pexels.com/photos/10845119/pexels-photo-10845119.jpeg?w=700&h=700",
          "comment_count": "7"
        }
      ]
    }
  },
  "GET /api/articles/:article_id": {
    "description": "serves an a single article object by it's ID",
    "exampleResponse": {
      "article": {
        "article_id": 2,
        "title": "The Rise Of Thinking Machines: How IBM's Watson Takes On The World",
        "topic": "coding",
        "author": "jessjelly",
        "body": "Many people know Watson as the IBM-developed cognitive super computer that won the Jeopardy! gameshow in 2011. In truth, Watson is not actually a computer but a set of algorithms and APIs, and since winning TV fame (and a $1 million prize) IBM has put it to use tackling tough problems in every industry from healthcare to finance. Most recently, IBM has announced several new partnerships which aim to take things even further, and put its cognitive capabilities to use solving a whole new range of problems around the world.",
        "created_at": "2020-05-14T00:02:00.000Z",
        "votes": 0,
        "article_img_url": "https://images.pexels.com/photos/373543/pexels-photo-373543.jpeg?w=700&h=700"
      }
    }
  },
  "GET /api/articles/:article_id/comments": {
    "description": "serves an array of comments for a particular article based on it's ID, ordered by default from newest to oldest comments",
    "exampleResponse": {
      "comments": [
        {
          "comment_id": 146,
          "body": "Soluta autem fuga non alias. Odit eligendi voluptas reiciendis repudiandae reiciendis doloribus adipisci qui consequuntur. Et dignissimos unde optio. Recusandae aspernatur eius error. Eos autem et iusto sunt fuga ipsam omnis voluptatem rerum.",
          "article_id": 4,
          "author": "jessjelly",
          "votes": 6,
          "created_at": "2020-10-12T11:23:00.000Z"
        },
        {
          "comment_id": 14,
          "body": "Iure quas est omnis porro. Est in est distinctio sequi consectetur rerum deserunt. Et et reiciendis. Consequatur distinctio sint porro neque molestiae.",
          "article_id": 4,
          "author": "weegembump",
          "votes": -4,
          "created_at": "2020-08-14T13:09:00.000Z"
        }
      ]
    }
  },
  "GET /api/comments/:comment_id": {
    "description": "successfully deletes a comment based on the comment ID",
    "exampleResponse": {
      "": {}
    }
  },
  "GET /api/users": {
    "description": "serves an array of all topics",
    "exampleResponse": {
      "users": [
        {
          "username": "tickle122",
          "name": "Tom Tickle",
          "avatar_url": "https://vignette.wikia.nocookie.net/mrmen/images/d/d6/Mr-Tickle-9a.png/revision/latest?cb=20180127221953"
        },
        {
          "username": "grumpy19",
          "name": "Paul Grump",
          "avatar_url": "https://vignette.wikia.nocookie.net/mrmen/images/7/78/Mr-Grumpy-3A.PNG/revision/latest?cb=20170707233013"
        },
        {
          "username": "happyamy2016",
          "name": "Amy Happy",
          "avatar_url": "https://vignette1.wikia.nocookie.net/mrmen/images/7/7f/Mr_Happy.jpg/revision/latest?cb=20140102171729"
        }
      ]
    }
  }
}
